zhanzr/cy8ckit-demo/app/mtb_shared/retarget-io/latest-v1.X/source/cy_retarget_io.c
#if defined(COMPONENT_MTB_HAL)
// UART HAL object used by BSP for Debug UART port
static mtb_hal_uart_t* cy_retarget_io_uart_obj = NULL;
#elif defined(CY_USING_HAL)
// UART HAL object used by BSP for Debug UART port
cyhal_uart_t cy_retarget_io_uart_obj;
#else
// SCB address that will be used for retarget-io UART
static CySCB_Type* cy_retarget_io_uart = NULL;
#endif


// Tracks the previous character sent to output stream
#ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
static char cy_retarget_io_stdout_prev_char = 0;
#endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF


#if !defined(COMPONENT_RETARGET_IO_CUSTOM)
//--------------------------------------------------------------------------------------------------
// cy_retarget_io_getchar
//--------------------------------------------------------------------------------------------------
static inline cy_rslt_t cy_retarget_io_getchar(char* c)
{
    #if defined(COMPONENT_MTB_HAL)
    CY_ASSERT(NULL != cy_retarget_io_uart_obj);
    return mtb_hal_uart_get(cy_retarget_io_uart_obj, (uint8_t*)c, 0);
    #elif defined(CY_USING_HAL)
    return cyhal_uart_getc(&cy_retarget_io_uart_obj, (uint8_t*)c, 0);
    #else
    uint32_t read_value = Cy_SCB_UART_Get(cy_retarget_io_uart);
    //Wait until the character is received
    while (CY_SCB_UART_RX_NO_DATA == read_value)
    {
        read_value = Cy_SCB_UART_Get(cy_retarget_io_uart);
    }
    *c = (uint8_t)read_value;
    return CY_RSLT_SUCCESS;
    #endif // if defined(COMPONENT_MTB_HAL)
}


#endif // !defined(COMPONENT_RETARGET_IO_CUSTOM)


#if !defined(COMPONENT_RETARGET_IO_CUSTOM)
//--------------------------------------------------------------------------------------------------
// cy_retarget_io_putchar
//--------------------------------------------------------------------------------------------------
static inline cy_rslt_t cy_retarget_io_putchar(char c)
{
    #if defined(COMPONENT_MTB_HAL)
    CY_ASSERT(NULL != cy_retarget_io_uart_obj);
    return mtb_hal_uart_put(cy_retarget_io_uart_obj, (uint8_t)c);
    #elif defined(CY_USING_HAL)
    return cyhal_uart_putc(&cy_retarget_io_uart_obj, (uint8_t)c);
    #else
    uint32_t count = 0UL;
    while (count == 0UL)
    {
        count = Cy_SCB_UART_Put(cy_retarget_io_uart, c);
    }
    return CY_RSLT_SUCCESS;
    #endif //defined(COMPONENT_MTB_HAL)
}


#endif // !defined(COMPONENT_RETARGET_IO_CUSTOM)


#if defined(__ARMCC_VERSION) // ARM-MDK
//--------------------------------------------------------------------------------------------------
// cy_retarget_io_fputc_common
//--------------------------------------------------------------------------------------------------
static inline int cy_retarget_io_fputc_common(int ch, FILE* f)
{
    (void)f;
    cy_rslt_t rslt = CY_RSLT_SUCCESS;
    #ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
    if (((char)ch == '\n') && (cy_retarget_io_stdout_prev_char != '\r'))
    {
        rslt = cy_retarget_io_putchar('\r');
    }
    #endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF

    if (CY_RSLT_SUCCESS == rslt)
    {
        rslt = cy_retarget_io_putchar(ch);
    }

    #ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
    if (CY_RSLT_SUCCESS == rslt)
    {
        cy_retarget_io_stdout_prev_char = (char)ch;
    }
    #endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF

    return (CY_RSLT_SUCCESS == rslt) ? ch : EOF;
}


#if defined (COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// $Sub$$fputc
//--------------------------------------------------------------------------------------------------
int $Sub$$fputc(int ch, FILE* f)
#else
//--------------------------------------------------------------------------------------------------
// fputc
//--------------------------------------------------------------------------------------------------
int fputc(int ch, FILE* f)
#endif /* defined(COMPONENT_MTB_HAL) */
{
    return cy_retarget_io_fputc_common(ch, f);
}


#if defined (COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// $Sub$$fputc unlocked
//--------------------------------------------------------------------------------------------------
int $Sub$$_fputc$unlocked(int ch, FILE* f)
#else
//--------------------------------------------------------------------------------------------------
// _fputc$unlocked
//--------------------------------------------------------------------------------------------------
int _fputc$unlocked(int ch, FILE* f)
#endif /* defined(COMPONENT_MTB_HAL) */
{
    return cy_retarget_io_fputc_common(ch, f);
}


#elif defined(__llvm__)

//--------------------------------------------------------------------------------------------------
// uart_putc
//--------------------------------------------------------------------------------------------------
static int uart_putc(char c, FILE* file)
{
    (void)file;
    cy_rslt_t rslt = CY_RSLT_SUCCESS;
    #ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
    if (((c == '\n') && (cy_retarget_io_stdout_prev_char != '\r')))
    {
        rslt = cy_retarget_io_putchar('\r');
    }
    #endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF
    if (CY_RSLT_SUCCESS == rslt)
    {
        cy_retarget_io_putchar(c);
    }
    #ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
    if (CY_RSLT_SUCCESS == rslt)
    {
        cy_retarget_io_stdout_prev_char = c;
    }
    #endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF

    return (CY_RSLT_SUCCESS == rslt) ? c : EOF;
}


//--------------------------------------------------------------------------------------------------
// uart_getc
//--------------------------------------------------------------------------------------------------
static int uart_getc(FILE* file)
{
    (void)file;
    char c;
    cy_rslt_t rslt = cy_retarget_io_getchar(&c);
    return (CY_RSLT_SUCCESS == rslt) ? c : EOF;
}


static FILE __stdio = FDEV_SETUP_STREAM(uart_putc,
                                        uart_getc,
                                        NULL,
                                        _FDEV_SETUP_RW);

