zhanzr/cy8ckit-demo/app/mtb_shared/retarget-io/latest-v1.X/source/cy_retarget_io.c
FILE* const stdin = &__stdio;

__strong_reference(stdin, stdout);

__strong_reference(stdin, stderr);

#elif defined (__ICCARM__) // IAR
    #include <yfuns.h>

//--------------------------------------------------------------------------------------------------
// __write
//--------------------------------------------------------------------------------------------------
size_t __write(int handle, const unsigned char* buffer, size_t size)
{
    size_t nChars = 0;
    // This template only writes to "standard out", for all other file handles it returns failure.
    if (handle != _LLIO_STDOUT)
    {
        return (_LLIO_ERROR);
    }
    if (buffer != NULL)
    {
        cy_rslt_t rslt = CY_RSLT_SUCCESS;
        for (; nChars < size; ++nChars)
        {
            #ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            if ((*buffer == '\n') && (cy_retarget_io_stdout_prev_char != '\r'))
            {
                rslt = cy_retarget_io_putchar('\r');
            }
            #endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF

            if (rslt == CY_RSLT_SUCCESS)
            {
                rslt = cy_retarget_io_putchar(*buffer);
            }

            if (rslt != CY_RSLT_SUCCESS)
            {
                break;
            }

            #ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            cy_retarget_io_stdout_prev_char = *buffer;
            #endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            ++buffer;
        }
    }
    return (nChars);
}


#else // (__GNUC__)  GCC
#if !defined(CY_RETARGET_IO_NO_FLOAT)
// Add an explicit reference to the floating point printf library to allow the usage of floating
// point conversion specifier.
__asm(".global _printf_float");
#endif
//--------------------------------------------------------------------------------------------------
// _write
//--------------------------------------------------------------------------------------------------
int32_t _write(int32_t fd, const cy_char8_t* ptr, int32_t len)
{
    int32_t nChars = 0;
    (void)fd;
    if (ptr != NULL)
    {
        cy_rslt_t rslt = CY_RSLT_SUCCESS;
        cy_retarget_io_mutex_acquire();
        for (; nChars < len; ++nChars)
        {
            #ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            if ((*ptr == '\n') && (cy_retarget_io_stdout_prev_char != '\r'))
            {
                rslt = cy_retarget_io_putchar('\r');
            }
            #endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF

            if (CY_RSLT_SUCCESS == rslt)
            {
                rslt = cy_retarget_io_putchar((uint32_t)*ptr);
            }

            if (CY_RSLT_SUCCESS != rslt)
            {
                break;
            }

            #ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            cy_retarget_io_stdout_prev_char = *ptr;
            #endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            ++ptr;
        }
        cy_retarget_io_mutex_release();
    }
    return (nChars);
}


#endif // if defined(__ARMCC_VERSION)


#if defined(__ARMCC_VERSION) // ARM-MDK
#if defined (COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// $Sub$$fgetc
//--------------------------------------------------------------------------------------------------
int $Sub$$fgetc(FILE* f)
#else
//--------------------------------------------------------------------------------------------------
// fgetc
//--------------------------------------------------------------------------------------------------
int fgetc(FILE* f)
#endif /* defined(COMPONENT_MTB_HAL) */
{
    (void)f;
    char c;
    cy_rslt_t rslt = cy_retarget_io_getchar(&c);
    return (CY_RSLT_SUCCESS == rslt) ? c : EOF;
}


#if defined (COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// $Sub$$_fgetc$unlocked
//--------------------------------------------------------------------------------------------------
int $Sub$$_fgetc$unlocked(FILE* f)
#else
//--------------------------------------------------------------------------------------------------
// _fgetc$unlocked
//--------------------------------------------------------------------------------------------------
int _fgetc$unlocked(FILE* f)
#endif /* defined(COMPONENT_MTB_HAL) */
{
    (void)f;
    char c;
    cy_rslt_t rslt = cy_retarget_io_getchar(&c);
    return (CY_RSLT_SUCCESS == rslt) ? c : EOF;
}


#elif defined (__ICCARM__) // IAR
//--------------------------------------------------------------------------------------------------
// __read
//--------------------------------------------------------------------------------------------------
size_t __read(int handle, unsigned char* buffer, size_t size)
{
    // This template only reads from "standard in", for all other file handles it returns failure.
    if ((handle != _LLIO_STDIN) || (buffer == NULL))
    {
        return (_LLIO_ERROR);
    }
    else
    {
        cy_rslt_t rslt = cy_retarget_io_getchar((char*)buffer);
        return (CY_RSLT_SUCCESS == rslt) ? 1 : 0;
    }
}


#elif defined(__llvm__)
// Nothing to do, putc/getc all defined in the first #if/#else section.

#else // (__GNUC__)  GCC
#if !defined(CY_RETARGET_IO_NO_FLOAT)
// Add an explicit reference to the floating point scanf library to allow the usage of floating
// point conversion specifier.
__asm(".global _scanf_float");
#endif
//--------------------------------------------------------------------------------------------------
// _read
//--------------------------------------------------------------------------------------------------
int32_t _read(int32_t fd, cy_char8_t* ptr, int32_t len)
{
    (void)fd;

    int32_t nChars = 0;
    if (ptr != NULL)
    {
        cy_rslt_t rslt;
        do
        {
            rslt = cy_retarget_io_getchar(ptr);
            if (rslt == CY_RSLT_SUCCESS)
            {
                ++nChars;
                if ((*ptr == '\n') || (*ptr == '\r'))
                {
                    break;
                }
                ptr++;
            }
        } while ((rslt == CY_RSLT_SUCCESS) && (nChars < len));
    }

    return (nChars);
}


#endif // if defined(__ARMCC_VERSION)

