zhanzr/cy8ckit-demo/app/mtb_shared/retarget-io/latest-v1.X/source/cy_retarget_io.c
#if defined(__ARMCC_VERSION) // ARM-MDK
// Include _sys_* prototypes provided by ARM Compiler runtime library
    #include <rt_sys.h>

// Prevent linkage of library functions that use semihosting calls
__asm(".global __use_no_semihosting\n\t");

// Enable the linker to select an optimized library that does not include code to handle input
// arguments to main()
__asm(".global __ARM_use_no_argv\n\t");

//--------------------------------------------------------------------------------------------------
// _sys_open
//
// Open a file: dummy implementation.
// Everything goes to the same output, no need to translate the file names
// (__stdin_name/__stdout_name/__stderr_name) to descriptor numbers
//--------------------------------------------------------------------------------------------------
FILEHANDLE __attribute__((weak)) _sys_open(const char* name, int openmode)
{
    (void)name;
    (void)openmode;
    return 1;
}


//--------------------------------------------------------------------------------------------------
// _sys_close
//
// Close a file: dummy implementation.
//--------------------------------------------------------------------------------------------------
int __attribute__((weak)) _sys_close(FILEHANDLE fh)
{
    (void)fh;
    return 0;
}


//--------------------------------------------------------------------------------------------------
// _sys_write
//
// Write to a file: dummy implementation.
// The low-level function fputc retargets output to use UART TX
//--------------------------------------------------------------------------------------------------
int __attribute__((weak)) _sys_write(FILEHANDLE fh, const unsigned char* buf, unsigned len,
                                     int mode)
{
    (void)fh;
    (void)buf;
    (void)len;
    (void)mode;
    return 0;
}


//--------------------------------------------------------------------------------------------------
// _sys_read
//
// Read from a file: dummy implementation.
// The low-level function fputc retargets input to use UART RX
//--------------------------------------------------------------------------------------------------
int __attribute__((weak)) _sys_read(FILEHANDLE fh, unsigned char* buf, unsigned len, int mode)
{
    (void)fh;
    (void)buf;
    (void)len;
    (void)mode;
    return -1;
}


//--------------------------------------------------------------------------------------------------
// _ttywrch
//
// Write a character to the output channel: dummy implementation.
//--------------------------------------------------------------------------------------------------
void __attribute__((weak)) _ttywrch(int ch)
{
    (void)ch;
}


//--------------------------------------------------------------------------------------------------
// _sys_istty
//
// Check if the file is connected to a terminal: dummy implementation
//--------------------------------------------------------------------------------------------------
int __attribute__((weak)) _sys_istty(FILEHANDLE fh)
{
    (void)fh;
    return 0;
}


//--------------------------------------------------------------------------------------------------
// _sys_seek
//
// Move the file position to a given offset: dummy implementation
//--------------------------------------------------------------------------------------------------
int __attribute__((weak)) _sys_seek(FILEHANDLE fh, long pos)
{
    (void)fh;
    (void)pos;
    return -1;
}


//--------------------------------------------------------------------------------------------------
// _sys_flen
// Return the current length of a file: dummy implementation
//--------------------------------------------------------------------------------------------------
long __attribute__((weak)) _sys_flen(FILEHANDLE fh)
{
    (void)fh;
    return 0;
}


//--------------------------------------------------------------------------------------------------
// _sys_exit
//
// Terminate the program: dummy implementation
//--------------------------------------------------------------------------------------------------
void __attribute__((weak)) _sys_exit(int returncode)
{
    (void)returncode;
    for (;;)
    {
        // Halt here forever
    }
}


//--------------------------------------------------------------------------------------------------
// _sys_command_string
//
// Return a pointer to the command line: dummy implementation
//--------------------------------------------------------------------------------------------------
char __attribute__((weak)) *_sys_command_string(char* cmd, int len)
{
    (void)cmd;
    (void)len;
    return NULL;
}


#endif // ARM-MDK

#if defined (COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// cy_retarget_io_init
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_retarget_io_init(mtb_hal_uart_t* obj)
{
    CY_ASSERT(NULL != obj);
    cy_retarget_io_uart_obj = obj;
    return cy_retarget_io_mutex_init();
}


#elif (defined(CY_USING_HAL) || defined(DOXYGEN))
//--------------------------------------------------------------------------------------------------
// cy_retarget_io_init_fc
//
// Enables user to provide flow control pins during initialization
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_retarget_io_init_fc(cyhal_gpio_t tx, cyhal_gpio_t rx, cyhal_gpio_t cts,
                                 cyhal_gpio_t rts, uint32_t baudrate)
{
    const cyhal_uart_cfg_t uart_config =
    {
        .data_bits          = 8,
        .stop_bits          = 1,
        .parity             = CYHAL_UART_PARITY_NONE,
        .rx_buffer          = NULL,
        .rx_buffer_size     = 0
    };

    #if (CYHAL_API_VERSION >= 2)
    cy_rslt_t result = cyhal_uart_init(&cy_retarget_io_uart_obj, tx, rx, cts, rts, NULL,
                                       &uart_config);
    #else // HAL API before version 2
    cy_rslt_t result = cyhal_uart_init(&cy_retarget_io_uart_obj, tx, rx, NULL, &uart_config);
    if (result == CY_RSLT_SUCCESS)
    {
        result = cyhal_uart_set_flow_control(&cy_retarget_io_uart_obj, cts, rts);
    }
    #endif

    if (result == CY_RSLT_SUCCESS)
    {
        result = cyhal_uart_set_baud(&cy_retarget_io_uart_obj, baudrate, NULL);
    }

    if (result == CY_RSLT_SUCCESS)
    {
        result = cy_retarget_io_mutex_init();
    }

    return result;
}


//--------------------------------------------------------------------------------------------------
// cy_retarget_io_init_hal
//
// Initailize retarget-io mutex for thead-safe during initialization
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_retarget_io_init_hal(void)
{
    return cy_retarget_io_mutex_init();
}


#else // if defined(COMPONENT_MTB_HAL)

//--------------------------------------------------------------------------------------------------
// cy_retarget_io_init
//
// Initializes the UART for retarget-io.  UART must already be initialized and enabled.
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_retarget_io_init(CySCB_Type* uart)
{
    if (uart == NULL)
    {
        return CY_RETARGET_IO_RSLT_NULL_UART_PTR;
    }
    else
    {
        cy_retarget_io_uart = uart;
        return cy_retarget_io_mutex_init();
    }
}


