zhanzr/cy8ckit-demo/app/mtb_shared/retarget-io/latest-v1.X/source/cy_retarget_io.c
#endif // defined(COMPONENT_MTB_HAL)


//--------------------------------------------------------------------------------------------------
// cy_retarget_io_is_tx_active
//--------------------------------------------------------------------------------------------------
bool cy_retarget_io_is_tx_active(void)
{
    #if defined(COMPONENT_MTB_HAL)
    CY_ASSERT(NULL != cy_retarget_io_uart_obj);
    return mtb_hal_uart_is_tx_active(cy_retarget_io_uart_obj);
    #elif defined (CY_USING_HAL)
    return cyhal_uart_is_tx_active(&cy_retarget_io_uart_obj);
    #else
    return !Cy_SCB_IsTxComplete(cy_retarget_io_uart);
    #endif
}


//--------------------------------------------------------------------------------------------------
// cy_retarget_io_deinit
//--------------------------------------------------------------------------------------------------
void cy_retarget_io_deinit(void)
{
    // Since the largest hardware buffer would be 256 bytes
    // it takes about 500 ms to transmit the 256 bytes at 9600 baud.
    // Thus 1000 ms gives roughly 50% padding to this time.
    int32_t timeout_remaining_ms = 1000;
    while (timeout_remaining_ms > 0)
    {
        if (!cy_retarget_io_is_tx_active())
        {
            break;
        }
        #if defined(COMPONENT_MTB_HAL)
        mtb_hal_system_delay_ms(1);
        #elif defined(CY_USING_HAL)
        cyhal_system_delay_ms(1);
        #else
        Cy_SysLib_Delay(1);
        #endif //defined(COMPONENT_MTB_HAL)
        timeout_remaining_ms--;
    }
    CY_ASSERT(timeout_remaining_ms != 0);
    #if defined(COMPONENT_MTB_HAL)
    cy_retarget_io_uart_obj = NULL;
    #elif defined(CY_USING_HAL)
    cyhal_uart_free(&cy_retarget_io_uart_obj);
    #else
    cy_retarget_io_uart = NULL;
    #endif //defined(COMPONENT_MTB_HAL)
    cy_retarget_io_mutex_deinit();
}


#if defined(COMPONENT_MTB_HAL) || defined(DOXYGEN)
//--------------------------------------------------------------------------------------------------
// cy_retarget_io_change_baud_rate
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_retarget_io_change_baud_rate(uint32_t baud_rate, uint32_t* actual_baud)
{
    if (cy_retarget_io_uart_obj == NULL)
    {
        return CY_RSLT_TYPE_ERROR;
    }

    while (cy_retarget_io_is_tx_active() == true)
    {
        // Wait for transmission to complete
    }

    return (mtb_hal_uart_set_baud(cy_retarget_io_uart_obj, baud_rate, actual_baud));
}


#endif // defined(COMPONENT_MTB_HAL) || defined(DOXYGEN)

#if defined(__cplusplus)
}
#endif
